WELCOME_TEXT = ('Привет, {}!\nВас приветствует @GCD_bot, ваш надежный помощник в поиске '
                'клинических исследований. На нашем сайте gcd-russia.com вы узнаете больше об условиях использования '
                'сервиса. Продолжая общение с ботом, вы автоматически подтверждаете свое согласие.')

RETURN_TEXT = 'С возвращением, {}!\nВы можете пройти опрос заново для обновления Ваших данных'

ROLE_TEXT = 'Уточните, пожалуйста, в каком качестве вы хотели бы участвовать в клинических исследованиях?'

SPEC_TEXT = 'Выберите, пожалуйста, вашу специализацию...'

CITY_REFERAL_TEXT = 'Хорошо! Теперь укажите город, в котором вы ищете клиническое исследование?'

CITY_RESEARCHER_TEXT = 'Хорошо! Теперь укажите город по кнопке ниже?'

SELECTING_TEXT = 'Подбираем клинические исследования, подождите...'

IS_SELECTED_TEXT = 'Подходящее исследование:\n{}'

NO_SELECTED_TEXT = ('К сожалению, в указанных городах  "{}" для специализаций {} пока нет подходящих исследований.\n '
                    'Мы активно расширяемся, чтобы быть в курсе, выберите предпочтительный способ коммуникации:')

REQUEST_COMMUNICATION_TEXT = ('Для завершения процесса подбора и участия в клинических исследованиях, укажите '
                              'предпочтительный способ связи:')

COMMUNICATION_MESSAGE = ('Благодарим за предоставленные контактные данные. \nНаш менеджер свяжется с '
                         'вами в ближайшее время. Как мы можем к вам обращаться?')

CONTACT_TELEGRAM_TEXT = 'Пожалуйста, поделитесь профилем Телеграм по кнопке ниже'

CONTACT_WHATSAPP_TEXT = 'Пожалуйста, напишите номер телефона, привязанный к Вашему аккаунту WhatsApp'

CONTACT_PHONE_TEXT = 'Пожалуйста, напишите номер телефона, по которому с Вами можно связаться'

CONTACT_EMAIL_TEXT = 'Пожалуйста, напишите адрес электронной почты, по которому с Вами можно связаться'

INCORRECT_PHONE_TEXT = 'Вы указали некорректный номер телефона!\nПопробуйте еще раз!'

INCORRECT_EMAIL_TEXT = 'Вы указали некорректный электронный адрес!\nПопробуйте еще раз!'

ROLE_REFERAL_LAST_RESEARCH_TEXT = ('Благодарим за ваше участие, {}!\n'
                                   'Менеджер свяжется с вами для обсуждения деталей участия в клинических испытаниях.')

ROLE_REFERAL_LAST_NO_RESEARCH_TEXT = ('Благодарим вас за участие, {}!\nМы обязательно '
                                      'свяжемся с вами, как только появится клиническое исследование '
                                      'в городе {} по специализации {} в '
                                      'роли Врача-исследователя.')

LAST_TEXT = ('Благодарим за отправку заявки на исследование, {}!\n'
             'Менеджер свяжется с вами для обсуждения деталей')

VACANCY_TEXT = ('{}, пока наш менеджер обрабатывает ваш запрос, '
                'предлагаем вам ознакомиться с нашими актуальными вакансиями по [ссылке].')

RESUME_TEXT = (' Также у нас есть удобный конструктор резюме, который позволит '
               'вам быстро заполнить форму М3 с распознаванием документов, '
               'и он доступен [по этой ссылке]. Благодарим за ваш интерес!')
